Sharki-66/womo-home-esp32/firmware/display/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# Task-WDT: 10s Timeout – PNG-Pre-Decode (einmalig bei Theme-Änderung) kann ~500ms dauern
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_TASK_WDT_TIMEOUT_S=10
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
# WiFi/LwIP-Allokationen bevorzugen PSRAM, damit interner SRAM für DMA (LCD Bounce-Buffer) frei bleibt
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# PSRAM-Fallback für alle Malloc-Größen (0 = kein min. interner Threshold)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# Interner DMA-Reserve-Pool: 32 KB
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# Bounce-Buffer: 4 Linien à 800 px × 2 Byte × 2 Buffer = ~12.8 KB DMA-SRAM (passt sicher)
CONFIG_EXAMPLE_LCD_RGB_BOUNCE_BUFFER_HEIGHT=4
# LVGL-Task: 16 KB in PSRAM (lodepng-PNG-Decoder braucht ~12 KB Stack-Tiefe)
CONFIG_EXAMPLE_LVGL_PORT_TASK_STACK_SIZE_KB=16
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_EXAMPLE_LVGL_PORT_TASK_CORE=1
CONFIG_EXAMPLE_LVGL_PORT_AVOID_TEAR_ENABLE=y

CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y
CONFIG_I2CDEV_USE_LEGACY_DRIVER=n

# mbedTLS muss PSRAM nutzen – internes SRAM reicht nicht (~39 KB frei)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_EXAMPLE_LVGL_PORT_TASK_MAX_DELAY_MS=12
CONFIG_EXAMPLE_LVGL_PORT_TASK_MIN_DELAY_MS=4
CONFIG_EXAMPLE_LVGL_PORT_TASK_PRIORITY=4

# LVGL v9 spezifisch
CONFIG_LV_USE_BACKWARD_COMPATIBILITY=y
# PNG-Decoder: lodepng für LV_COLOR_FORMAT_RAW_ALPHA (Ducato, Wetter-Icons, Logo)
CONFIG_LV_USE_LODEPNG=y
# CLIB_MALLOC: LVGL nutzt direkt malloc/free/realloc (kein interner TLSF-Pool).
# Mit SPIRAM_MALLOC_ALWAYSINTERNAL=0 gehen große Allokationen automatisch in PSRAM.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
# LVGL Image-Cache: 2 MB in PSRAM.
# Ducato-PNG (800×480×4=1.5MB) wird beim ERSTEN Render einmalig von lodepng dekodiert
# und dann gecacht → jeder weitere Redraw = Cache-Hit, kein Decoder-Aufruf mehr.
# WDT-Timeout 10s schützt den einmaligen Decode-Vorgang (~400ms).
CONFIG_LV_CACHE_DEF_SIZE=2097152
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=8